# DividedSurfaceCurveChainGeneralProblem Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DividedSurfaceFailures..::..DividedSurfaceCurveChainGeneralProblem Property
BuiltInFailures..::..DividedSurfaceFailures Class See Also
---
The chain formed by these curve elements cannot be processed and will be ignored.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DividedSurfaceCurveChainGeneralProblem { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceCurveChainGeneralProblem As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DividedSurfaceCurveChainGeneralProblem {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace